[
    {
    "text": "We're all taught to chase 'big things.'\nBig jobs. Big houses. Big names.\n\nBut the truth? Life has always been carried by the small, human moments we don't post about.\n\nIt's your father quietly switching off the fan in your room at night so you don't catch a cold.\nIt's your best friend texting 'reached home?' even when it's 3 a.m.\nIt's your grandmother slipping an extra ₹500 note in your hand saying, 'Don't tell anyone.'\nIt's your colleague covering for you in a meeting when you couldn't hold it together.\nIt's your neighbor sending food when they hear you haven't cooked in days.\n\nThese things don't trend.\nBut they keep us alive.\n\nOne day, your salary, your titles, your LinkedIn achievements - all of it will blur.\n\nBut people will remember how safe you made them feel.\nHow seen. How loved.\n\nWe keep asking, 'What's the meaning of life?'\nMaybe it's this:\nTo leave gentleness behind.\nTo be the reason someone still believes the world can be kind.\n\nSo if you're reading this today - call your parents, hug your friends tighter, forgive faster, smile at a stranger.\nBecause in the end, the most human thing we can do… is love each other in small ways that feel bigger than life itself.",
    "engagement": 0
  },
  {
    "text": "Curiosity > Intelligence. You don't need to know all the answers. You just need the hunger to ask better questions.",
    "engagement": 0
  },
  
  {
    "text": "Appreciation in Action at Coforge !!\n\nLast month July, we celebrated Appreciation in Action, a moment to shine a spotlight on the incredible efforts of our colleagues/Teamates.\n\nThis initiative not only boosted morale but also fostered a culture of gratitude and recognition. We're proud to have a team that values and acknowledges each other's contributions.\nWhether it's a kind word, Thankyou note, Appreciation mail,or spreading smiles by sharing Post cards, each Appreciation counts and each Appreciation leads to motivation and encouragement ...\n\nThanks to all for all the encouragement, appreciation I have received in any form",
    "engagement": 0
  },
  {
    "text": "As a leader, I believe in the power of appreciation and recognition. It's not just about acknowledging achievements; it's about fostering a culture of gratitude and encouragement within our teams.\n\nWhen we take the time to appreciate our colleagues, we create an environment where everyone feels valued and motivated to give their best. A simple 'thank you' or a note of appreciation can go a long way in boosting morale and building stronger relationships.\n\nLet's make it a habit to recognize the efforts of those around us, whether it's through a quick message, a shout-out in a meeting, or a small gesture of kindness. Together, we can create a workplace where appreciation is at the heart of everything we do.\n\n#Leadership #Appreciation #Gratitude #Teamwork #Motivation",
    "engagement": 0
  },
  {
    "text": "Who was the first motivational speaker?\n\nNot a bestselling author.\nNot a seminar celebrity.\nIt was hashtag#ShreeKrishna on the battlefield of hashtag#Kurukshetra.\n\nWhen Arjun world's greatest archer dropped his bow, torn between duty and emotion, Krishna didn't just comfort him. He delivered the Bhagavad Gita a timeless call to purpose, resilience, and action.\n\nKrishna could inspire Arjun because he had walked the path. He knew sacrifice. He knew dharma. He knew the courage it takes to fight for what's right.\n\nToday, almost everyone calls themselves a 'motivational speaker.' But most of them haven't faced the storms they speak about. It's like teaching swimming while standing safe on the shore.\n\nReal motivation doesn't come from borrowed quotes or flashy slides. It comes from lived hashtag#experience and hashtag#authenticity.\n\nWe need fewer 'speakers' and more guides like Krishna, voices who speak from the heart of experience rather than the comfort of theory.",
    "engagement": 0
  },
  {
    "text": "Just wrapped up an amazing hackathon with my team . Sleepless nights, endless brainstorming, and lots of coffee but the experience was priceless. We didn't just build a prototype, we built friendships and learned to thrive under pressure. Winning was great, but the real prize was growth.",
    "engagement": 0
  },
  {
    "text": "Feedback is not criticism—it's a mirror.The people who care enough to give you honest feedback are the ones who want to see you succeed. Don't run away from it, embrace it. Every piece of feedback is a free lesson you didn't have to pay for.",
    "engagement": 0
  },
  {
    "text": "Work-life balance is not about working less. It's about working with intention and living with presence.Stop glorifying busyness, start prioritizing well-being. A rested mind is more innovative than an exhausted one.",
    "engagement": 0
  },
  {
    "text": "The best leaders are not the ones who stand in front and command. They are the ones who stand behind and uplift. Leadership is not about power—it's about responsibility, empathy, and service.",
    "engagement": 0
  },
  {
    "text": "Rejection doesn't mean you're not good enough. It means the opportunity wasn't the right fit. Every 'no' is redirecting you to a better 'yes.' Keep going.",
    "engagement": 0
  },
  {
    "text": "Your career is not a ladder. It's a jungle gym. Sometimes you climb up, sometimes sideways, sometimes you take a step down to gain momentum. Don't get stuck chasing titles—chase skills, growth, and fulfillment.",
    "engagement": 0
  },
  {
    "text": "Networking isn't about collecting contacts. It's about building relationships. People don't remember how many business cards you shared—they remember how you made them feel.",
    "engagement": 0
  }
  ]
  